src/test/resources/requests/get_records_invalid_6_soap.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope"
	xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<soapenv:Body>
		<GetRecords maxRecords="20" outputFormat="text/xml"
			outputSchema="http://www.isotc211.org/2005/gmd" requestId="csw:1" resultType="results" startPosition="2"
			xmlns="http://www.opengis.net/cat/csw/2.0.2" service="CSW" version="2.0.2">
			<Query typeNames="csw:dataset">
				<ElementSetName typeNames="">brief</ElementSetName>
				<Constraint version="1.1.0">
				</Constraint>
			</Query>
		</GetRecords>
	</soapenv:Body>
</soapenv:Envelope>
